# Install via
# $ brew tap Homebrew/bundle
# $ brew bundle

# This puts the applications in the correct folder
cask_args appdir: '/Applications'

# List of brew repositories
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'heroku/brew'

# Use GNU instead of BSD commands
# the with-default-names uses normal name, rather than g-prefixed
brew 'coreutils'
brew 'findutils'
brew 'readline'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gpatch'
brew 'grep'
brew 'gzip'
brew 'watch'
brew 'wdiff'
brew 'wget'

brew 'awscli'
brew 'bash' # Newest version of Bash
brew 'bash-completion@2' # Bash tab completion for Bash
brew 'cheat' # Simple cheat-sheets; install and run `$ cheat tar`
brew 'emacs'
brew 'file-formula' # guess file type
brew 'gh' # https://cli.github.com
brew 'graphviz' # for python tree model plotting
brew 'htop' # Better top command
brew 'imagemagick'
brew 'less'
brew 'make'
brew 'node'
brew 'rbenv'
brew 'ruby-install'
brew 'rename'
brew 'rsync'
brew 'screen'
brew 'tmux'
brew 'tree' # Visualize directory structure
brew 'unzip'
brew 'vim'
brew 'zsh'

# Git and some surrounds
brew 'git'
brew 'git-lfs'
# brew 'git-flow'
brew 'git-extras'

# brew 'svn'

# Easy cd https://github.com/rupa/z
brew 'z'

# Mac Swiss Army Knife https://github.com/rgcr/m-cli
brew 'm-cli'

# Support for Mac App Store apps https://github.com/mas-cli/mas
brew 'mas'

# Heroku; run this after to use autocomplete with the CLI tools: heroku autocomplete --refresh-cache
brew 'heroku'

# Install additional applications

cask '1password'  # 1Password latest
# cask '1password7'
cask 'ableton-live-lite'
# cask 'aquamacs'
cask 'docker'
# cask 'firefox'
cask 'google-chrome'
# cask 'iterm2'
cask 'itsycal'
cask 'jupyter-notebook-viewer'
# cask 'keybase'
cask 'kindle'
cask 'loopback'
cask 'noisy'
cask 'omnidisksweeper'
# cask 'oversight'  # alert on camera or mic usage
cask 'postgres-unofficial'  # https://postgresapp.com/documentation/cli-tools.html
# add to ~/.bash_profile: PATH="/Applications/Postgres.app/Contents/Versions/latest/bin:$PATH"
# cask 'postico'
# cask 'postman'
cask 'protonvpn'  # VPN
cask 'rectangle'  # window manager
cask 'slack'
cask 'spotify'
cask 'steam'
# cask 'sublime-text'
# cask 'sublime-text-dev'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'wordservice'
cask 'zoom'

# Install QuickLook plugins https://github.com/sindresorhus/quick-look-plugins
cask 'betterzip'  # preview archives
cask 'syntax-highlight', args: { no_quarantine: true }  # open "Syntax Highlight.app" after installing
# cask 'qlcolorcode'  # syntax highlighting
cask 'qlmarkdown'
cask 'qlstephen'  # view plain text files without a file extension
cask 'quicklook-json'
# cask 'qlvideo'
# cask 'quicklook-csv'

# Install Fonts
cask 'font-fira-code'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Install apps via Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Deliveries', id: 290986013
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Table Tool', id: 1122008420  # CSV viewer/editor and quicklook
mas 'The Unarchiver', id: 425424353
mas 'Tot', id: 1491071483
# mas '1Password 7 - Password Manager', id: 1333542190
# mas 'Binaural', id: 946812450
# mas 'JustFocus', id: 1142151959
# mas 'Mail Notifr', id: 808154494
# mas 'Poolsuite FM', id: 1514817810
# mas 'Slack', id: 803453959

# Install Safari extensions via Mac App Store
mas '1Password for Safari', id: 1569813296
# mas 'DuckDuckGo Privacy Essentials', id: 1482920575
# mas 'Hush', id: 1544743900
# mas 'Polyglot', id: 1471801525  # Safari extension for translation
mas 'StopTheMadness', id: 1376402589
# mas 'Vinegar - Tube Cleaner', id: 1591303229
mas 'Wipr', id: 1320666476
# https://github.com/Sh1d0w/clean-links
